erhansakarya/mcu/stm32f7_c_sw/SPI_driver/Drivers/inc/RCC_driver.h
#ifndef __RCC_DRIVER_H
#define __RCC_DRIVER_H

#ifdef __cplusplus
 extern "C" {
#endif /* __cplusplus */

#include "stm32f767xx.h"

#include "util.h"

#define GPIOA_CLK_EN (RCC->AHB1ENR |= RCC_AHB1ENR_GPIOAEN)
#define GPIOB_CLK_EN (RCC->AHB1ENR |= RCC_AHB1ENR_GPIOBEN)
#define GPIOC_CLK_EN (RCC->AHB1ENR |= RCC_AHB1ENR_GPIOCEN)
#define GPIOD_CLK_EN (RCC->AHB1ENR |= RCC_AHB1ENR_GPIODEN)
#define GPIOE_CLK_EN (RCC->AHB1ENR |= RCC_AHB1ENR_GPIOEEN)
#define GPIOF_CLK_EN (RCC->AHB1ENR |= RCC_AHB1ENR_GPIOFEN)
#define GPIOG_CLK_EN (RCC->AHB1ENR |= RCC_AHB1ENR_GPIOGEN)
#define GPIOH_CLK_EN (RCC->AHB1ENR |= RCC_AHB1ENR_GPIOHEN)
#define GPIOI_CLK_EN (RCC->AHB1ENR |= RCC_AHB1ENR_GPIOIEN)
#define GPIOJ_CLK_EN (RCC->AHB1ENR |= RCC_AHB1ENR_GPIOJEN)
#define GPIOK_CLK_EN (RCC->AHB1ENR |= RCC_AHB1ENR_GPIOKEN)

#define GPIOA_CLK_DIS (RCC->AHB1ENR &= ~RCC_AHB1ENR_GPIOAEN)
#define GPIOB_CLK_DIS (RCC->AHB1ENR &= ~RCC_AHB1ENR_GPIOBEN)
#define GPIOC_CLK_DIS (RCC->AHB1ENR &= ~RCC_AHB1ENR_GPIOCEN)
#define GPIOD_CLK_DIS (RCC->AHB1ENR &= ~RCC_AHB1ENR_GPIODEN)
#define GPIOE_CLK_DIS (RCC->AHB1ENR &= ~RCC_AHB1ENR_GPIOEEN)
#define GPIOF_CLK_DIS (RCC->AHB1ENR &= ~RCC_AHB1ENR_GPIOFEN)
#define GPIOG_CLK_DIS (RCC->AHB1ENR &= ~RCC_AHB1ENR_GPIOGEN)
#define GPIOH_CLK_DIS (RCC->AHB1ENR &= ~RCC_AHB1ENR_GPIOHEN)
#define GPIOI_CLK_DIS (RCC->AHB1ENR &= ~RCC_AHB1ENR_GPIOIEN)
#define GPIOJ_CLK_DIS (RCC->AHB1ENR &= ~RCC_AHB1ENR_GPIOJEN)
#define GPIOK_CLK_DIS (RCC->AHB1ENR &= ~RCC_AHB1ENR_GPIOKEN)

#define GPIOA_RESET RCC->AHB1RSTR |= RCC_AHB1RSTR_GPIOARST; RCC->AHB1RSTR &= ~RCC_AHB1RSTR_GPIOARST
#define GPIOB_RESET RCC->AHB1RSTR |= RCC_AHB1RSTR_GPIOBRST; RCC->AHB1RSTR &= ~RCC_AHB1RSTR_GPIOBRST
#define GPIOC_RESET RCC->AHB1RSTR |= RCC_AHB1RSTR_GPIOCRST; RCC->AHB1RSTR &= ~RCC_AHB1RSTR_GPIOCRST
#define GPIOD_RESET RCC->AHB1RSTR |= RCC_AHB1RSTR_GPIODRST; RCC->AHB1RSTR &= ~RCC_AHB1RSTR_GPIODRST
#define GPIOE_RESET RCC->AHB1RSTR |= RCC_AHB1RSTR_GPIOERST; RCC->AHB1RSTR &= ~RCC_AHB1RSTR_GPIOERST
#define GPIOF_RESET RCC->AHB1RSTR |= RCC_AHB1RSTR_GPIOFRST; RCC->AHB1RSTR &= ~RCC_AHB1RSTR_GPIOFRST
#define GPIOG_RESET RCC->AHB1RSTR |= RCC_AHB1RSTR_GPIOGRST; RCC->AHB1RSTR &= ~RCC_AHB1RSTR_GPIOGRST
#define GPIOH_RESET RCC->AHB1RSTR |= RCC_AHB1RSTR_GPIOHRST; RCC->AHB1RSTR &= ~RCC_AHB1RSTR_GPIOHRST
#define GPIOI_RESET RCC->AHB1RSTR |= RCC_AHB1RSTR_GPIOIRST; RCC->AHB1RSTR &= ~RCC_AHB1RSTR_GPIOIRST
#define GPIOJ_RESET RCC->AHB1RSTR |= RCC_AHB1RSTR_GPIOJRST; RCC->AHB1RSTR &= ~RCC_AHB1RSTR_GPIOJRST
#define GPIOK_RESET RCC->AHB1RSTR |= RCC_AHB1RSTR_GPIOKRST; RCC->AHB1RSTR &= ~RCC_AHB1RSTR_GPIOKRST

#define SPI1_CLK_EN (RCC->APB2ENR |= RCC_APB2ENR_SPI1EN)
#define SPI2_CLK_EN (RCC->APB1ENR |= RCC_APB1ENR_SPI2EN)
#define SPI3_CLK_EN (RCC->APB1ENR |= RCC_APB1ENR_SPI3EN)
#define SPI4_CLK_EN (RCC->APB2ENR |= RCC_APB2ENR_SPI4EN)

#define SPI1_CLK_DIS (RCC->APB2ENR &= ~RCC_APB2ENR_SPI1EN)
#define SPI2_CLK_DIS (RCC->APB1ENR &= ~RCC_APB1ENR_SPI2EN)
#define SPI3_CLK_DIS (RCC->APB1ENR &= ~RCC_APB1ENR_SPI3EN)
#define SPI4_CLK_DIS (RCC->APB2ENR &= ~RCC_APB2ENR_SPI4EN)

#define SPI1_RESET RCC->APB2RSTR |= RCC_APB2RSTR_SPI1RST; RCC->APB2RSTR &= ~RCC_APB2RSTR_SPI1RST
#define SPI2_RESET RCC->APB1RSTR |= RCC_APB1RSTR_SPI2RST; RCC->APB1RSTR &= ~RCC_APB1RSTR_SPI2RST
#define SPI3_RESET RCC->APB1RSTR |= RCC_APB1RSTR_SPI3RST; RCC->APB1RSTR &= ~RCC_APB1RSTR_SPI3RST
#define SPI4_RESET RCC->APB2RSTR |= RCC_APB2RSTR_SPI4RST; RCC->APB2RSTR &= ~RCC_APB2RSTR_SPI4RST

#endif
